app/controllers/payments_controller.rb

  def index
    @payments = Payment.all
---
SELECT "payments".* FROM "payments"

  def new
    @payment = Payment.new
    @parents = Parent.all
---
SELECT "parents".* FROM "parents"

  def edit
    @parents = Parent.all
---
SELECT "parents".* FROM "parents"

  def create
    @payment = Payment.new(payment_params)
    @payment.parent_id = params[:parent_id]


    respond_to do |format|
      if @payment.save
---
INSERT INTO "payments" ("date", "amount_usd", "amount_bs", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2022-01-04"], ["amount_usd", 10.0], ["amount_bs", 40.0], ["parent_id", 980190963], ["created_at", "2022-01-04 15:56:05.442399"], ["updated_at", "2022-01-04 15:56:05.442399"]]

  def update

    respond_to do |format|
      if @payment.update(payment_params) && @payment.update(parent_id: params[:parent_id])
---
UPDATE "payments" SET "date" = ?, "amount_usd" = ?, "amount_bs" = ?, "updated_at" = ? WHERE "payments"."id" = ?  [["date", "2022-01-29"], ["amount_usd", 10.0], ["amount_bs", 46.8], ["updated_at", "2022-01-30 00:34:11.130633"], ["id", 10]]

  def destroy
    @payment.destroy
---
DELETE FROM "payments" WHERE "payments"."id" = ?  [["id", 2]]

    def set_payment
      @payment = Payment.find(params[:id])
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]