app/controllers/students_controller.rb

  def index
    @students = Student.order(:name)
---
SELECT "students".* FROM "students" ORDER BY "students"."name" ASC

  def new
    @student = Student.new
    @parents = Parent.order :name
---
SELECT "parents".* FROM "parents" WHERE "parents"."name" = ? LIMIT ?  [["name", "Lourdes Sebastiani"], ["LIMIT", 1]]

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "college", "email", "mobile", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Camila Briceño"], ["college", ""], ["email", ""], ["mobile", ""], ["parent_id", 980190963], ["created_at", "2021-12-15 16:09:24.067107"], ["updated_at", "2021-12-15 16:09:24.067107"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Charlye Reyes"], ["updated_at", "2022-01-27 14:04:19.871154"], ["id", 9]]