app/controllers/tutors_controller.rb

SELECT "tutors".* FROM "tutors" ORDER BY "tutors"."name" ASC
---
  def index
    @tutors = Tutor.order(:name)

INSERT INTO "tutors" ("name", "subject", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Maryví"], ["subject", "Matemática"], ["created_at", "2021-12-27 20:54:03.146575"], ["updated_at", "2021-12-27 20:54:03.146575"]]
---
  def create
    @tutor = Tutor.new(tutor_params)

    respond_to do |format|
      if @tutor.save

UPDATE "tutors" SET "name" = ?, "updated_at" = ? WHERE "tutors"."id" = ?  [["name", "Maryví Camacho"], ["updated_at", "2022-01-26 15:56:52.958284"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tutor.update(tutor_params)

DELETE FROM "tutors" WHERE "tutors"."id" = ?  [["id", 980190962]]
---
  def destroy
    @tutor.destroy

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tutor
      @tutor = Tutor.find(params[:id])