app/controllers/tutorings_controller.rb

  def index
    # sorted = Tutoring.all.sort_by {|t| t.date}
    # @tutorings = sorted.reverse
    @tutorings = Tutoring.order(date: :desc, start: :asc)
---
SELECT "tutorings".* FROM "tutorings" ORDER BY "tutorings"."date" DESC, "tutorings"."start" ASC

  def new
    @tutoring = Tutoring.new
    @students = Student.order(:name)
    @tutors = Tutor.order(:name)
---
SELECT "students".* FROM "students" ORDER BY "students"."name" ASC
SELECT "tutors".* FROM "tutors" ORDER BY "tutors"."name" ASC