app/controllers/tutorings_controller.rb

  def index
    sorted = Tutoring.all.sort_by {|t| t.date}
---
SELECT "tutorings".* FROM "tutorings"

  def new
    @tutoring = Tutoring.new
    @students = Student.all
    @tutors = Tutor.all
---
SELECT "students".* FROM "students"
SELECT "tutors".* FROM "tutors"

  def edit

    @students = Student.all
    @tutors = Tutor.all
---
SELECT "students".* FROM "students"
SELECT "tutors".* FROM "tutors"

  def create


    @tutoring = Tutoring.new(tutoring_params)
    @tutoring.student_id = params[:student_id]
    @tutoring.tutor_id = params[:tutor_id]

    respond_to do |format|
      if @tutoring.save
---
INSERT INTO "tutorings" ("date", "start", "end", "tutor_id", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    student_id = params[:student_id]
    tutor_id = params[:tutor_id]
    @tutoring.update(student_id: student_id, tutor_id: tutor_id)
    respond_to do |format|
      if @tutoring.update(tutoring_params)
---
UPDATE "tutorings" SET "tutor_id" = ?, "student_id" = ?, "updated_at" = ? WHERE "tutorings"."id" = ?  [["tutor_id", 1], ["student_id", 2], ["updated_at", "2021-12-28 18:44:35.429990"], ["id", 1]]
UPDATE "tutorings" SET "date" = ?, "updated_at" = ? WHERE "tutorings"."id" = ?  [["date", "2022-01-05"], ["updated_at", "2022-01-03 00:15:35.942895"], ["id", 11]]

  def destroy
    @tutoring.destroy
---
DELETE FROM "tutorings" WHERE "tutorings"."id" = ?  [["id", 3]]

    def set_tutoring
      @tutoring = Tutoring.find(params[:id])
---
SELECT "tutorings".* FROM "tutorings" WHERE "tutorings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]